package com.yunnex.ops.erp.modules.sys.utils;

public enum OpenBankEnum {
    OB0(0,"请选择银行"),
    OB1(1,"浙商银行"),
    OB2(2,"桂林银行"),
    OB3(3,"包商银行"),
    OB4(4,"齐商银行"),
    OB5(5,"上海银行"),
    OB6(6,"晋城市商业银行"),
    OB7(7,"河南省农村信用合作联合社"),
    OB8(8,"哈尔滨银行"),
    OB9(9,"杭州联合农村商业银行股份有限公司"),
    OB10(10,"江南农村商业银行"),
    OB11(11,"长治商业银行"),
    OB12(12,"锦州银行"),
    OB13(13,"湖南省农村信用社联合社"),
    OB14(14,"浙江民泰商业银行"),
    OB15(15,"珠海华润银行股份有限公司总部营业部"),
    OB16(16,"富滇银行股份有限公司"),
    OB17(17,"中山市农村信用合作联社"),
    OB18(18,"福建省农村信用社联合社"),
    OB19(19,"江苏江阴农村商业银行股份有限公司"),
    OB20(20,"烟台银行股份有限公司"),
    OB21(21,"湖北省农村信用社联合社结算中心"),
    OB22(22,"江苏民丰农村商业银行股份有限公司营业部"),
    OB23(23,"江苏海门农村商业银行股份有限公司营业部"),
    OB24(24,"广西壮族自治区农村信用社联合社"),
    OB25(25,"贵阳银行股份有限公司"),
    OB26(26,"九江银行合肥分行营业部"),
    OB27(27,"安庆独秀农村商业银行股份有限公司"),
    OB28(28,"景德镇市商业银行股份有限公司"),
    OB29(29,"宁夏黄河农村商业银行股份有限公司"),
    OB30(30,"重庆农村商业银行股份有限公司营业部"),
    OB31(31,"江苏省农村信用社联合社"),
    OB32(32,"江苏省农村信用社联合社"),
    OB33(33,"南洋商业银行（中国）有限公司"),
    OB34(34,"郑州银行股份有限公司"),
    OB35(35,"晋商银行"),
    OB36(36,"乌鲁木齐市商业银行"),
    OB37(37,"上海农村商业银行"),
    OB38(38,"盛京银行"),
    OB39(39,"台州市商业银行"),
    OB40(40,"新疆维吾尔自治区农村信用社"),
    OB41(41,"天山农商银行"),
    OB42(42,"华融湘江银行股份有限公司"),
    OB43(43,"南京银行股份有限公司"),
    OB44(44,"佛山顺德农村商业银行股份有限公司"),
    OB45(45,"渤海银行股份有限公司"),
    OB46(46,"广东省农村信用社联合社"),
    OB47(47,"江苏常熟农村商业银行股份有限公司"),
    OB48(48,"德州银行股份有限公司"),
    OB49(49,"青岛银行"),
    OB50(50,"厦门银行股份有限公司"),
    OB51(51,"襄垣县农村信用合作联社"),
    OB52(52,"陕西镇安农村合作银行"),
    OB53(53,"徐州淮海农村商业银行股份有限公司营业部"),
    OB54(54,"江苏海安农村商业银行股份有限公司营业部"),
    OB55(55,"潍坊银行"),
    OB56(56,"大连银行"),
    OB57(57,"巴彦淖尔河套农村商业银行"),
    OB58(58,"长沙银行股份有限公司"),
    OB59(59,"广西北部湾银行"),
    OB60(60,"山西侯马农村商业银行股份有限公司"),
    OB61(61,"上饶银行营业部"),
    OB62(62,"新疆汇和银行股份有限公司营业部"),
    OB63(63,"张家港农村商业银行"),
    OB64(64,"中国光大银行"),
    OB65(65,"华夏银行"),
    OB66(66,"中国民生银行"),
    OB67(67,"广发银行"),
    OB68(68,"深圳发展银行(,平安银行)"),
    OB69(69,"招商银行"),
    OB70(70,"兴业银行"),
    OB71(71,"浦发银行"),
    OB72(72,"中国邮政储蓄银行"),
    OB73(73,"北京银行"),
    OB74(74,"鄂尔多斯市东胜蒙银村镇银行股份有限公司"),
    OB75(75,"鄂尔多斯银行"),
    OB76(76,"阳泉市商业银行"),
    OB77(77,"银座村镇银行股份有限公司"),
    OB78(78,"莱商银行"),
    OB79(79,"营口银行"),
    OB80(80,"浙江泰隆商业银行"),
    OB81(81,"吉林银行"),
    OB82(82,"丰镇市农村信用合作联社"),
    OB83(83,"呼和浩特金谷农村合作银行"),
    OB84(84,"深圳农村商业银行股份有限公司"),
    OB85(85,"广东华兴银行股份有限公司"),
    OB86(86,"玉溪市商业银行"),
    OB87(87,"杭州银行股份有限公司"),
    OB88(88,"泉州银行股份有限公司"),
    OB89(89,"广西桂林漓江农村合作银行"),
    OB90(90,"东莞农村商业银行股份有限公司"),
    OB91(91,"抚顺银行股份有限公司"),
    OB92(92,"江苏泗阳农村商业银行营业部"),
    OB93(93,"中信银行"),
    OB94(94,"长安银行股份有限公司"),
    OB95(95,"贵州银行股份有限公司"),
    OB96(96,"旬阳县农村信用合作社联合社"),
    OB97(97,"中国工商银行"),
    OB98(98,"中国农业银行"),
    OB99(99,"中国银行"),
    OB100(100,"中国建设银行"),
    OB101(101,"交通银行"),
    OB102(102,"中国邮政储蓄银行"),
    OB103(103,"北京农村商业银行"),
    OB104(104,"河南省农村信用社"),
    OB105(105,"唐山市商业银行"),
    OB106(106,"新乡银行"),
    OB107(107,"苏州银行"),
    OB108(108,"兰州银行股份有限公司"),
    OB109(109,"江苏银行"),
    OB110(110,"徽商银行"),
    OB111(111,"宁波银行"),
    OB112(112,"广州农村商业银行"),
    OB113(113,"吴江农村商业银行"),
    OB114(114,"柳州银行"),
    OB115(115,"太原市城区农村信用合作联社"),
    OB116(116,"龙江银行股份有限公司"),
    OB117(117,"曲靖市商业银行"),
    OB118(118,"孝义市农村信用合作联社"),
    OB119(119,"江苏句容农村商业银行股份有限公司"),
    OB120(120,"邢台银行股份有限公司"),
    OB121(121,"邯郸银行股份有限公司"),
    OB122(122,"天津银行股份有限公司"),
    OB123(123,"山东济南润丰农村合作银行营业部"),
    OB124(124,"江苏启东农村商业银行股份有限公司营业部"),
    OB125(125,"石河子国民村镇银行有限责任公司"),
    OB126(126,"衡水市商业银行股份有限公司"),
    OB127(127,"江苏靖江农村商业银行股份有限公司营业部"),
    OB128(128,"宁夏银行总行营业部"),
    OB129(129,"东营银行股份有限公司"),
    OB130(130,"长安银行股份有限公司西安大唐西市支行"),
    OB131(131,"衡水市桃城区农村信用合作联社营业部"),
    OB132(132,"石嘴山银行股份有限公司"),
    OB133(133,"百色右江华润村镇银行股份有限公司"),
    OB134(134,"澳洲联邦银行（伊川）村镇银行有限责任公司"),
    OB135(135,"蒲县农村信用合作联社营业部"),
    OB136(136,"温州银行股份有限公司营业部"),
    OB137(137,"河北银行股份有限公司"),
    OB138(138,"广州增城长江村镇银行有限责任公司"),
    OB139(139,"广州银行"),
    OB140(140,"江苏姜堰农村商业银行股份有限公司营业部"),
    OB141(141, "江苏射阳农村商业银行营业部"),

    OBOTHER(200, "其他银行");

    private int id;
    private String text;

    public int getId() {
        return id;
    }

    public void setId(int id) {
        this.id = id;
    }

    public String getText() {
        return text;
    }

    public void setText(String text) {
        this.text = text;
    }

    private OpenBankEnum(int id, String text) {
        this.id = id;
        this.text = text;
    }

    public static String get(int id) {
        OpenBankEnum[] values = values();
        for (OpenBankEnum openBankEnum : values) {
            if (openBankEnum.getId() == id) {
                return openBankEnum.getText();
            }
        }
        return "";
    }
    
}
